tutorials/multicomponentFluid/lockExchange/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue sludge 0
    volScalarFieldValue water 1
);

regions
(
    boxToCell
    {
        box (0 0 0) (5 2 2);

        fieldValues
        (
            volScalarFieldValue sludge 1
            volScalarFieldValue water 0
        );
    }
);

// ************************************************************************* //
